# CantSetSlantedColumnEndPlane Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..CantSetSlantedColumnEndPlane Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Unable to determine slanted column end cut plane.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CantSetSlantedColumnEndPlane { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CantSetSlantedColumnEndPlane As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CantSetSlantedColumnEndPlane {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace